13/data/attachments/8f5aaee689075bd4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_e68121d1-a160-4b43-b0de-9e07121b941b</nif:username>
            <nif:friendToBeAdded>Cheryl_yourself_Friend_50865_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>